Upgrade PE Labs README
